{
    "$description": "Core opacity primitives for transparency effects. Opacity controls element visibility from fully transparent (0) to fully opaque (1). Use for: disabled states, overlays, hover effects, layering. ACCESSIBILITY: Ensure sufficient contrast when using low opacity on text - reduced opacity reduces contrast ratio.",
    "opacity": {
        "0": {
            "$description": "Fully transparent (0%). Use for: hidden elements, animation start states, invisible interactive areas. Element is invisible but may still be interactive. CSS: opacity: 0; visibility: hidden for truly hidden.",
            "$value": 0
        },
        "5": {
            "$description": "5% opacity - barely visible. Use for: extremely subtle hover states, ghost backgrounds, near-invisible separators. Only visible against high-contrast backgrounds.",
            "$value": 0.05
        },
        "10": {
            "$description": "10% opacity - subtle transparency. Use for: light hover backgrounds, subtle shadows, faint overlays. Minimally perceptible change.",
            "$value": 0.1
        },
        "20": {
            "$description": "20% opacity - light transparency. Use for: hover states, light overlays, muted backgrounds. Noticeable but unobtrusive.",
            "$value": 0.2
        },
        "25": {
            "$description": "25% opacity - quarter visible. Use for: skeleton loading states, light dimming, subtle backgrounds. Common for placeholder content.",
            "$value": 0.25
        },
        "30": {
            "$description": "30% opacity - moderate transparency. Use for: image overlays, text shadows, moderate dimming. Visible but allows content behind to show clearly.",
            "$value": 0.3
        },
        "40": {
            "$description": "40% opacity - semi-transparent. Use for: medium overlays, watermarks, partially hidden content. Balanced visibility.",
            "$value": 0.4
        },
        "50": {
            "$description": "50% opacity - half visible. Use for: disabled elements (semantic alias: 'disabled'), balanced overlays, de-emphasized content. CAUTION: May not meet contrast requirements for text.",
            "$value": 0.5
        },
        "60": {
            "$description": "60% opacity - mostly visible. Use for: modal backdrops (semantic alias: 'overlay'), dimmed backgrounds, focus-drawing overlays. Content behind is visible but de-emphasized.",
            "$value": 0.6
        },
        "70": {
            "$description": "70% opacity - high visibility. Use for: heavy overlays, strong dimming, de-emphasized backgrounds. Most content visible but clearly secondary.",
            "$value": 0.7
        },
        "75": {
            "$description": "75% opacity - three-quarters visible. Use for: dark overlays, strong backgrounds, significant dimming. Mostly solid with hint of transparency.",
            "$value": 0.75
        },
        "80": {
            "$description": "80% opacity - mostly solid. Use for: nearly-opaque overlays, frosted glass effects (with backdrop-filter), heavy backgrounds.",
            "$value": 0.8
        },
        "90": {
            "$description": "90% opacity - nearly solid. Use for: subtle transparency effects, slight see-through, glass-like surfaces. Almost indistinguishable from solid.",
            "$value": 0.9
        },
        "100": {
            "$description": "Fully opaque (100%). Use for: solid elements, removing inherited transparency, default element state. CSS: opacity: 1; (default browser value).",
            "$value": 1
        },
        "$description": "Opacity scale from 0 (invisible) to 1 (solid). Values 0-100 represent percentages. Use semantic names (disabled, overlay) when purpose is clear. Numeric values for precise control. Combine with background colors for overlay effects.",
        "$type": "number",
        "disabled": {
            "$description": "Disabled element opacity (50%). SEMANTIC alias for opacity.50. Use for: disabled buttons, inactive controls, unavailable options. Universally recognized as 'inactive'. ACCESSIBILITY: Ensure disabled elements are still perceivable and their disabled state is communicated via aria-disabled.",
            "$value": 0.5
        },
        "overlay": {
            "$description": "Modal overlay opacity (60%). SEMANTIC alias for opacity.60. Use for: modal backdrops, lightbox backgrounds, focus-drawing overlays. Dims background while keeping it visible for context. Common in: Modal backdrop, Drawer overlay, image lightbox backgrounds.",
            "$value": 0.6
        }
    }
}
