{
    "$description": "Core z-index primitives for stacking order and layering. Z-index controls which elements appear on top when they overlap. RULE: Always use these tokens - never use arbitrary z-index values. Gaps of 100 between levels allow for intermediate values if needed. Higher z-index = visually on top.",
    "zIndex": {
        "$description": "Stacking layer scale for managing element overlap. Layers are separated by 100 to allow intermediate values. Order represents visual priority: base (bottom) → max (top). Elements should stay within their designated layer range.",
        "$type": "number",
        "app": {
            "$description": "Application layer (z-index: 100). Use for: app-level UI chrome, sidebars, persistent navigation. First elevated layer above base content. Common in: app shells, navigation drawers, persistent toolbars.",
            "$value": 100
        },
        "base": {
            "$description": "Base layer (z-index: 0). DEFAULT for all standard content. Use for: page content, cards, sections, anything in normal document flow. Establishes baseline - everything else stacks above this. Never use negative z-index unless absolutely necessary.",
            "$value": 0
        },
        "dropdown": {
            "$description": "Dropdown layer (z-index: 150). Use for: dropdown menus, select options, autocomplete lists, combobox panels. Above app chrome but below sticky headers. Common in: Select menu, Dropdown, Autocomplete, Menu, Popover (when not in modal).",
            "$value": 150
        },
        "max": {
            "$description": "Maximum layer (z-index: 9999). HIGHEST layer - use sparingly. Use for: critical system overlays, loading states that must block all interaction, debug overlays. Reserved for truly exceptional cases where nothing else should appear on top.",
            "$value": 9999
        },
        "modal": {
            "$description": "Modal layer (z-index: 400). Use for: modal dialogs, side drawers, full-screen overlays, dialog content. Primary overlay content layer - above backdrop but below popovers. Common in: Modal content, Drawer content, Dialog, Sheet, full-screen menus.",
            "$value": 400
        },
        "overlay": {
            "$description": "Overlay layer (z-index: 300). Use for: modal backdrops, drawer overlays, lightbox backgrounds, focus-trap containers. Dims/blocks underlying content. Separate from modal content to allow proper stacking. Common in: Modal backdrop, Drawer backdrop, lightbox overlay.",
            "$value": 300
        },
        "popover": {
            "$description": "Popover layer (z-index: 500). Use for: popovers triggered from within modals, nested floating elements, color pickers, date pickers in modals. Above modal content but below tooltips. Common in: DatePicker in modal, ColorPicker in modal, nested menus.",
            "$value": 500
        },
        "sticky": {
            "$description": "Sticky layer (z-index: 200). Use for: sticky headers, fixed navigation, persistent UI elements, scroll-aware banners. Stays visible during scroll but below overlay content. Common in: Sticky header, fixed sidebar, persistent action bars, scroll-to-top buttons.",
            "$value": 200
        },
        "tooltip": {
            "$description": "Tooltip layer (z-index: 600). Use for: tooltips, toasts, notifications, snackbars. Near top of standard layers. Common in: Tooltip, Toast, Snackbar, notification badges, loading indicators.",
            "$value": 600
        }
    }
}
