{
    "$description": "Core shadow/elevation primitives for creating depth hierarchy. Shadows indicate elevation - higher elements cast larger, softer shadows. Uses multi-layer shadows for realistic appearance: ambient (soft, wide) + key (sharp, directional). Light theme optimized - dark theme uses separate higher-opacity shadows. RULE: Match elevation to interaction level - static < hoverable < floating < modal.",
    "shadow": {
        "$type": "shadow",
        "$description": "Box-shadow scale from subtle to dramatic. Each shadow uses multiple layers for natural appearance. Elevation implies interaction priority: higher = more important/interactive. Rem units for blur/spread scale with font size. Choose shadow based on element's conceptual height above the page.",
        "xs": {
            "$value": "0 0.0625rem 0.1875rem rgba(0, 0, 0, 0.05), 0 0.0625rem 0.125rem rgba(0, 0, 0, 0.1)",
            "$description": "Extra small shadow - minimal elevation (1-2dp). Use for: subtle depth on cards at rest, input fields, low-emphasis containers, elements that could be flat. Barely noticeable - adds dimension without prominence. Common in: Card default state, Input fields, Table rows, subtle separation."
        },
        "sm": {
            "$value": "0 0.0625rem 0.1875rem rgba(0, 0, 0, 0.05), rgba(0, 0, 0, 0.05) 0 0.625rem 0.9375rem -0.3125rem, rgba(0, 0, 0, 0.04) 0 0.4375rem 0.4375rem -0.3125rem",
            "$description": "Small shadow - low elevation (4-6dp). Use for: card hover states, raised buttons, navigation elements, slightly prominent containers. Noticeable but not dramatic elevation. Common in: Card:hover, Button:raised, Dropdown trigger, Navigation bar, elevated sections."
        },
        "md": {
            "$value": "0 0.0625rem 0.1875rem rgba(0, 0, 0, 0.05), rgba(0, 0, 0, 0.05) 0 1.25rem 1.5625rem -0.3125rem, rgba(0, 0, 0, 0.04) 0 0.625rem 0.625rem -0.3125rem",
            "$description": "Medium shadow - moderate elevation (8-12dp). DEFAULT for floating elements. Use for: dropdown menus, popovers, tooltips, floating action buttons, autocomplete lists. Clearly floating above content. Common in: Dropdown menu, Popover, Select options, Autocomplete, FAB."
        },
        "lg": {
            "$value": "0 0.0625rem 0.1875rem rgba(0, 0, 0, 0.05), rgba(0, 0, 0, 0.05) 0 1.75rem 1.4375rem -0.4375rem, rgba(0, 0, 0, 0.04) 0 0.75rem 0.75rem -0.4375rem",
            "$description": "Large shadow - high elevation (16-24dp). Use for: dialogs, modals, drawers, notification toasts, temporary UI surfaces. Significantly elevated - demands attention. Common in: Modal dialogs, side Drawer, Toast notifications, contextual menus requiring focus."
        },
        "xl": {
            "$value": "0 0.0625rem 0.1875rem rgba(0, 0, 0, 0.05), rgba(0, 0, 0, 0.05) 0 2.25rem 1.75rem -0.4375rem, rgba(0, 0, 0, 0.04) 0 1.0625rem 1.0625rem -0.4375rem",
            "$description": "Extra large shadow - maximum elevation (24dp+). Use for: critical modals, full-screen overlays, maximum prominence elements. Dramatic elevation - use sparingly. Common in: Full-screen modals, critical dialogs, onboarding overlays, image lightboxes."
        },
        "inset": {
            "$value": "inset 0 0.125rem 0.25rem rgba(0, 0, 0, 0.1)",
            "$description": "Inset shadow - pressed/recessed appearance. Use for: pressed button states, input:focus, toggle switches (off state), embedded content areas. Creates illusion of pressing INTO the surface. Common in: Button:active, pressed toggles, embedded wells, search input backgrounds."
        },
        "footer": {
            "$value": "0 -0.0625rem 0.1875rem rgba(0, 0, 0, 0.05), 0 -0.625rem 0.9375rem -0.3125rem rgba(0, 0, 0, 0.04), 0 -0.4375rem 0.4375rem -0.3125rem rgba(0, 0, 0, 0.04)",
            "$description": "Footer shadow - upward-casting shadow for fixed footers. Use for: sticky footers, bottom navigation bars, action bars at bottom of screen. Shadow casts upward to show footer is above scrolling content. Common in: sticky page footers, bottom action bars, mobile bottom nav."
        },
        "none": {
            "$value": "none",
            "$description": "No shadow - flat appearance. Use for: flat design elements, removing inherited shadows, elements that should appear flush with background, focus states that use outline instead. CSS keyword. Common in: flat buttons, inline elements, focus states using outline."
        }
    }
}
