{
    "$description": "Core spacing primitives defining the spatial system. Based on a 4px/0.25rem base unit for consistency. Use spacing tokens for margins, paddings, and gaps. RULE: Always use spacing tokens instead of arbitrary values to maintain visual rhythm and consistency across the UI.",
    "spacing": {
        "$type": "dimension",
        "$description": "Component-level spacing scale for padding, margins, and gaps. Follows a non-linear scale optimized for common UI patterns. Use 2xs-xs for ultra-compact/tight UIs, sm for compact UIs, md for default spacing, lg-xl for breathing room, 2xl for maximum section separation.",
        "2xs": {
            "$value": "0.5rem",
            "$description": "spacing.2xs — 2x extra small spacing (8px). Use for: minimal internal padding, tight icon gaps, ultra-compact components, subtle spacing between inline elements."
        },
        "xs": {
            "$value": "0.625rem",
            "$description": "spacing.xs — Extra small spacing (10px). Use for: tight padding in compact components, icon-to-text gaps, inline element spacing, dense data tables."
        },
        "sm": {
            "$value": "0.75rem",
            "$description": "spacing.sm — Small spacing (12px). Use for: standard component internal padding, form field padding, list item padding, card content padding."
        },
        "md": {
            "$value": "1rem",
            "$description": "spacing.md — Medium spacing (16px). DEFAULT spacing value. Use for: standard gaps between elements, modal padding, card padding, section padding within components."
        },
        "lg": {
            "$value": "1.25rem",
            "$description": "spacing.lg — Large spacing (20px). Use for: generous padding, separation between related groups, dialog/modal padding, card spacing."
        },
        "xl": {
            "$value": "2rem",
            "$description": "spacing.xl — Extra large spacing (32px). Use for: major section separation, page-level margins, large component padding, hero sections."
        },
        "2xl": {
            "$value": "2.5rem",
            "$description": "spacing.2xl — 2x extra large spacing (40px). Use for: maximum section separation, page-level padding, large hero spacing, full-width container margins."
        }
    },
    "gridSpacing": {
        "$type": "dimension",
        "$description": "Grid and layout gutter spacing based on 8px grid. Use for CSS Grid gap, Flexbox gap, and multi-column layout gutters. Pixel values for precise grid alignment. All values are multiples of 8px.",
        "xs": {
            "$value": "8px",
            "$description": "gridSpacing.xs — Extra small grid gap (8px). Use for: compact card grids, dense dashboard layouts, mobile-optimized grids, icon grids."
        },
        "sm": {
            "$value": "16px",
            "$description": "gridSpacing.sm — Small grid gap (16px). Use for: standard card grids, form layouts, compact dashboard grids."
        },
        "md": {
            "$value": "24px",
            "$description": "gridSpacing.md — Medium grid gap (24px). Use for: default content grids, spacious card layouts, comfortable dashboard grids."
        },
        "lg": {
            "$value": "32px",
            "$description": "gridSpacing.lg — Large grid gap (32px). Use for: spacious card layouts, content grids, marketing pages."
        },
        "xl": {
            "$value": "40px",
            "$description": "gridSpacing.xl — Extra large grid gap (40px). Use for: hero grids, feature showcases, landing page layouts."
        },
        "2xl": {
            "$value": "48px",
            "$description": "gridSpacing.2xl — 2x extra large grid gap (48px). Use for: maximum separation in grids, presentation layouts, sparse artistic layouts."
        }
    },
    "verticalRhythm": {
        "$type": "dimension",
        "$description": "Baseline-aligned spacing for vertical rhythm in typography-heavy layouts. Based on 1.6rem (25.6px) baseline. Use for consistent vertical spacing in prose content, documentation, and text-heavy interfaces. Maintains readable flow in long-form content.",
        "xs": {
            "$value": "0.4rem",
            "$description": "verticalRhythm.xs — Quarter baseline (6.4px). Use for: list item spacing within tight lists, line spacing adjustments, micro-spacing in prose."
        },
        "sm": {
            "$value": "0.8rem",
            "$description": "verticalRhythm.sm — Half baseline (12.8px). Use for: heading bottom margins, spacing after inline elements, paragraph-adjacent element spacing."
        },
        "md": {
            "$value": "1.6rem",
            "$description": "verticalRhythm.md — Single baseline (25.6px). DEFAULT prose spacing. Use for: paragraph margins, standard content block spacing, default vertical rhythm."
        },
        "lg": {
            "$value": "2.4rem",
            "$description": "verticalRhythm.lg — 1.5 baselines (38.4px). Use for: heading top margins, spacing before new sections within content, emphasis breaks."
        },
        "xl": {
            "$value": "3.2rem",
            "$description": "verticalRhythm.xl — Double baseline (51.2px). Use for: major section breaks in prose, chapter-level separations, significant content divisions."
        },
        "2xl": {
            "$value": "4.8rem",
            "$description": "verticalRhythm.2xl — Triple baseline (76.8px). Use for: page section breaks, major content area separations, hero-to-content transitions."
        }
    }
}
