{
    "$description": "Alert/notification component tokens. Alerts display important messages that require user attention, providing feedback about system status, errors, warnings, success states, or informational notices. These tokens compose primitive tokens into alert-specific configurations. Use alerts for: form validation errors, success confirmations, system warnings, informational notices, dismissible notifications. VARIANTS: error (red), warning (amber), success (green), info (blue). ACCESSIBILITY: Use appropriate ARIA roles (alert for urgent, status for non-urgent), ensure sufficient color contrast, don't rely on color alone (use icons), and allow users to dismiss non-critical alerts.",
    "alert": {
        "padding": {
            "$type": "dimension",
            "$description": "Alert internal padding. Controls spacing between content and borders. Larger padding increases visual prominence and readability.",
            "xs": {
                "$value": "{spacing.xs}",
                "$description": "Extra small alert padding (10px). Use for: compact inline alerts, form field errors, dense notification lists. Minimal visual footprint."
            },
            "sm": {
                "$value": "{spacing.sm}",
                "$description": "Small alert padding (12px). Use for: standard form validation, secondary notifications, space-efficient layouts."
            },
            "md": {
                "$value": "{spacing.md}",
                "$description": "Medium alert padding (16px). DEFAULT. Use for: most alerts, system notifications, prominent user feedback. Good balance of prominence and space."
            },
            "lg": {
                "$value": "{spacing.lg}",
                "$description": "Large alert padding (20px). Use for: important system alerts, featured notifications, alerts with more content. More breathing room."
            },
            "xl": {
                "$value": "{spacing.xl}",
                "$description": "Extra large alert padding (32px). Use for: high-emphasis critical alerts, full-width banners, alerts with rich content or actions."
            }
        },
        "borderRadius": {
            "$value": "{radius.sm}",
            "$type": "dimension",
            "$description": "Alert border radius (4px). Slight rounding softens the alert container. Matches other form/content containers for visual consistency."
        },
        "borderWidth": {
            "$value": "{borderWidth.thin}",
            "$type": "dimension",
            "$description": "Alert border width (1px). Thin border provides subtle container definition. Border color varies by alert variant (error, warning, success, info)."
        },
        "icon": {
            "$description": "Alert icon configuration. Icons provide immediate visual identification of alert type (error, warning, success, info). ACCESSIBILITY: Icons supplement but don't replace text - essential for users who can't perceive color.",
            "size": {
                "$value": "1.25rem",
                "$type": "dimension",
                "$description": "Alert icon size (20px). Sized to be clearly visible alongside title/message text without dominating. Proportional to typical alert padding."
            },
            "gap": {
                "$value": "{spacing.sm}",
                "$type": "dimension",
                "$description": "Gap between icon and content (12px). Provides clear separation between status icon and alert text. Maintains visual association."
            }
        },
        "title": {
            "$description": "Alert title configuration. Title provides a brief summary of the alert. Not all alerts require titles - use for complex or important messages.",
            "fontSize": {
                "$value": "{fontSizes.sm}",
                "$description": "Alert title font size (14px). Same as body text but distinguished by weight. Keeps alerts compact while remaining readable."
            },
            "fontWeight": {
                "$value": "{fontWeights.semibold}",
                "$type": "fontWeight",
                "$description": "Alert title font weight (600). Semibold provides clear hierarchy between title and message without being overly heavy."
            },
            "lineHeight": {
                "$value": "{lineHeights.sm}",
                "$description": "Alert title line height (1.25). Tighter line height for single-line titles. Keeps alert compact vertically."
            }
        },
        "message": {
            "$description": "Alert message/body configuration. The message provides detailed information about the alert. Should be concise but informative.",
            "fontSize": {
                "$value": "{fontSizes.sm}",
                "$description": "Alert message font size (14px). Standard body text size for readability. Matches title size but lighter weight."
            },
            "lineHeight": {
                "$value": "{lineHeights.md}",
                "$description": "Alert message line height (1.5). More generous line height for multi-line messages. Improves readability of longer alert text."
            }
        },
        "closeButton": {
            "$description": "Alert close button (dismiss) configuration. Allows users to dismiss alerts. ACCESSIBILITY: Must be keyboard accessible and have visible focus state. Not all alerts should be dismissible - critical errors may need to persist.",
            "size": {
                "$value": "1.125rem",
                "$type": "dimension",
                "$description": "Close button size (18px). Clickable/tappable close icon. Sized for adequate touch target while not competing with alert content."
            },
            "offset": {
                "$value": "{spacing.sm}",
                "$type": "dimension",
                "$description": "Close button offset from edge (12px). Positions close button away from container edge for comfortable interaction and visual balance."
            }
        },
        "transition": {
            "$description": "Alert animation configuration. Controls entrance/exit animations for dynamic alerts (toasts, notifications). Static alerts may not need animations.",
            "duration": {
                "$value": "{motion.duration.normal}",
                "$description": "Alert transition duration (200ms). Moderate duration allows the animation to be perceived without feeling slow. Balances awareness and efficiency."
            },
            "easing": {
                "$description": "Alert transition easing functions. Different easing for enter (appearing) and exit (dismissing) creates natural motion.",
                "enter": {
                    "$value": "{motion.easing.easeOut}",
                    "$description": "Alert entrance easing (ease-out). Decelerating motion - alert arrives quickly and settles into place. Feels like it's sliding in."
                },
                "exit": {
                    "$value": "{motion.easing.easeIn}",
                    "$description": "Alert exit easing (ease-in). Accelerating motion - alert starts slow and speeds up as it leaves. Feels like it's sliding away."
                }
            }
        }
    }
}
