{
    "$description": "Table/data grid component tokens. Tables display structured data in rows and columns for scanning, comparing, and analyzing information. These tokens compose primitive tokens into table-specific configurations. Use tables for: data listings, comparison matrices, financial data, admin panels, search results. ACCESSIBILITY: Use semantic table elements (thead, tbody, th with scope) and consider row/column headers for screen readers.",
    "table": {
        "cell": {
            "$description": "Table cell configuration. Cells contain data and need appropriate padding for readability.",
            "padding": {
                "$type": "dimension",
                "$description": "Cell padding controls data density. Horizontal padding affects column separation; vertical padding affects row height.",
                "x": {
                    "xs": {
                        "$value": "{spacing.xs}",
                        "$description": "Extra small horizontal cell padding (10px). Dense tables for compact data display. Use when horizontal space is limited."
                    },
                    "sm": {
                        "$value": "{spacing.sm}",
                        "$description": "Small horizontal cell padding (12px). Standard density for most data tables. Good balance of data and whitespace."
                    },
                    "md": {
                        "$value": "{spacing.md}",
                        "$description": "Medium horizontal cell padding (16px). DEFAULT. Comfortable spacing for readable data. Recommended for most use cases."
                    },
                    "lg": {
                        "$value": "{spacing.lg}",
                        "$description": "Large horizontal cell padding (20px). Spacious tables with generous breathing room. Good for simple data with few columns."
                    },
                    "xl": {
                        "$value": "{spacing.xl}",
                        "$description": "Extra large horizontal cell padding (32px). Very spacious tables for presentation or limited data. Maximum readability."
                    }
                },
                "y": {
                    "xs": {
                        "$value": "{sizing.table.cellPaddingY.xs}",
                        "$description": "Extra small vertical cell padding (4px). Compact rows for dense data display like logs or detailed admin views."
                    },
                    "sm": {
                        "$value": "{sizing.table.cellPaddingY.sm}",
                        "$description": "Small vertical cell padding (6px). Standard density rows for most data tables. Efficient use of vertical space."
                    },
                    "md": {
                        "$value": "{sizing.table.cellPaddingY.md}",
                        "$description": "Medium vertical cell padding (8px). DEFAULT. Comfortable row height for general use. Good for scanning and selecting rows."
                    },
                    "lg": {
                        "$value": "{sizing.table.cellPaddingY.lg}",
                        "$description": "Large vertical cell padding (12px). Taller rows for better touch targets and readability. Good for mobile or complex cell content."
                    },
                    "xl": {
                        "$value": "{sizing.table.cellPaddingY.xl}",
                        "$description": "Extra large vertical cell padding (16px). Maximum row height for spacious tables. Use for rich cell content or presentation."
                    }
                }
            },
            "fontSize": {
                "$description": "Table cell font sizes. Slightly smaller than body text to fit more data while remaining readable.",
                "xs": {
                    "$value": "{fontSizes.xs}",
                    "$description": "Extra small table font size (12px). Compact text for dense data tables. Use for admin panels or data-heavy views."
                },
                "sm": {
                    "$value": "{fontSizes.sm}",
                    "$description": "Small table font size (14px). Standard data table text. Readable and space-efficient for most use cases."
                },
                "md": {
                    "$value": "{fontSizes.sm}",
                    "$description": "Medium table font size (14px). DEFAULT. Same as sm - keeps data compact while maintaining readability."
                },
                "lg": {
                    "$value": "{fontSizes.md}",
                    "$description": "Large table font size (16px). Larger text for improved readability. Good for simple tables or accessibility needs."
                },
                "xl": {
                    "$value": "{fontSizes.md}",
                    "$description": "Extra large table font size (16px). Same as lg - body text size for maximum readability in spacious tables."
                }
            }
        },
        "header": {
            "$description": "Table header row configuration. Headers label columns and typically have distinct styling.",
            "fontWeight": {
                "$value": "{fontWeights.semibold}",
                "$type": "fontWeight",
                "$description": "Table header font weight (600). Semibold headers clearly distinguish column labels from data. Important for scanability."
            },
            "fontSize": {
                "$value": "{fontSizes.sm}",
                "$description": "Table header font size (14px). Same as cell text but distinguished by weight and color. Consistent sizing aids alignment."
            }
        },
        "borderWidth": {
            "$value": "{borderWidth.thin}",
            "$type": "dimension",
            "$description": "Table border width (1px). Thin borders define cells without visual heaviness. Used for outer border and cell dividers."
        },
        "borderRadius": {
            "$value": "{radius.sm}",
            "$type": "dimension",
            "$description": "Table container border radius (4px). Slight rounding softens the table container. Only applies to outer border, not individual cells."
        },
        "transition": {
            "$description": "Table interaction transition configuration.",
            "duration": {
                "$value": "{motion.duration.fast}",
                "$description": "Table row hover transition duration (100ms). Fast transition for responsive hover feedback on rows."
            }
        }
    }
}
