{
    "$description": "Semantic color tokens for the dark theme. These tokens provide MEANING-based color usage rather than raw color values. RULE: Always use semantic tokens in components, not primitive palette colors. Semantic tokens ensure consistent color usage across the UI and enable theming. The dark theme uses light text on dark backgrounds for optimal readability and reduced eye strain in low-light environments.",
    "color": {
        "$description": "All semantic color assignments. Organized by: text colors, background colors, interactive states, status colors. Each semantic token references a primitive color from the palette. Use semantic names in code for maintainability and theme support. DARK THEME: Colors are adjusted for proper contrast on dark surfaces.",
        "$type": "color",
        "text": {
            "$value": "{color.white}",
            "$description": "Primary text color (#FFFFFF in dark theme). Use for: headings, body text, labels, primary content. HIGHEST contrast against dark body background. WCAG AAA compliant. Common in: Typography, labels, form field values, card content, navigation text."
        },
        "body": {
            "$value": "{color.dark.9}",
            "$description": "Body/page background color (darkest gray in dark theme). Use for: main page background, app shell, deepest surface layer. FOUNDATIONAL surface color - everything else layers on top with progressively lighter surfaces. Common in: App shell background, page wrapper, root container."
        },
        "bright": {
            "$value": "{color.white}",
            "$description": "Bright/emphasis text color. In dark theme, same as text (white). Use for: highest emphasis content, key figures, critical information, visual hierarchy peaks. Provides flexibility for themes where bright differs from text. Common in: Dashboard metrics, highlighted text, key stats."
        },
        "error": {
            "$value": "{color.red.4}",
            "$description": "Error state text color (red.4 - lighter red for dark theme). Adjusted lighter than light theme to maintain contrast on dark backgrounds. Use for: error messages, validation failures, destructive action warnings, critical alerts. ACCESSIBILITY: Combine with an icon - don't rely on color alone to convey errors. Common in: Form validation errors, Alert (error variant), Toast (error), inline error messages."
        },
        "placeholder": {
            "$value": "{color.gray.5}",
            "$description": "Placeholder text color (gray.5 for dark theme). Use for: input placeholder text, empty state hints, secondary guidance text. CAUTION: Not suitable for essential information - only use for hints that enhance, not provide, meaning. Common in: Input placeholders, Select placeholder, search hints, empty state descriptions."
        },
        "anchor": {
            "$value": "{color.blue.4}",
            "$description": "Anchor/link text color (blue.4 - lighter blue for dark theme). Adjusted lighter to maintain contrast on dark backgrounds. Use for: hyperlinks, clickable text, text buttons, navigation links. Must be distinguishable from surrounding text. ACCESSIBILITY: Ensure 3:1 contrast against non-link text per WCAG 1.4.1. Common in: Anchor elements, text-style buttons, breadcrumb links, inline navigation."
        },
        "default": {
            "$value": "{color.dark.7}",
            "$description": "Default surface/background color for components (dark.7 - elevated surface). Slightly lighter than body to create visual hierarchy. Use for: button backgrounds, input backgrounds, card surfaces, component base layer. Common in: Button (default variant), Input background, Card surface, Dropdown trigger, Tab panels."
        },
        "default-hover": {
            "$value": "{color.dark.6}",
            "$description": "Default hover background color (dark.6 - lighter surface). Use for: hover states on default surfaces, interactive row highlights, button hover feedback. In dark theme, hover states get LIGHTER (opposite of light theme). Common in: Button:hover, Table row:hover, List item:hover, Menu item:hover, Dropdown option:hover."
        },
        "default-color": {
            "$value": "{color.white}",
            "$description": "Default text color for default-background components. Use for: button text, input text, component labels. Pairs with 'default' background for proper contrast. Common in: Button text, Input value, Tab label, Menu item text, Badge text."
        },
        "default-border": {
            "$value": "{color.dark.4}",
            "$description": "Default border color (dark.4 - medium dark gray). Use for: input borders, card boundaries, component outlines, dividers. Provides subtle definition on dark surfaces. Common in: Input border, Card border, Table cell borders, Divider lines, Tab container borders."
        },
        "dimmed": {
            "$value": "{color.gray.5}",
            "$description": "Dimmed/muted text color (gray.5). Use for: secondary text, metadata, timestamps, captions, helper text, de-emphasized content. Lower contrast than primary text to establish visual hierarchy. Common in: Timestamps, bylines, helper text, secondary labels, metadata."
        },
        "disabled": {
            "$value": "{color.dark.6}",
            "$description": "Disabled element background color (dark.6). Use for: disabled button backgrounds, inactive input backgrounds, unavailable component surfaces. Visually indicates non-interactivity through muted appearance. ACCESSIBILITY: Use with aria-disabled='true'. Color alone is not sufficient - combine with disabled-color text. Common in: Button:disabled background, Input:disabled background, disabled toggle/switch."
        },
        "disabled-color": {
            "$value": "{color.gray.6}",
            "$description": "Disabled element text color (gray.6). Use for: disabled button text, inactive labels, unavailable option text. Reduced contrast indicates non-interactivity. ACCESSIBILITY: Disabled elements are exempt from WCAG contrast requirements BUT should still be perceivable. Pairs with 'disabled' background. Common in: Button:disabled text, Select:disabled option, disabled form label."
        },
        "disabled-border": {
            "$value": "{color.dark.5}",
            "$description": "Disabled element border color (dark.5). Use for: disabled input borders, inactive component outlines. Completes the disabled state trio (disabled, disabled-color, disabled-border). Common in: Input:disabled border, Button:disabled outline, disabled Card border."
        },
        "primary": {
            "$description": "Primary brand color variants (blue in ClearCo theme). Use primary colors for: main CTAs, selected states, active navigation, brand emphasis. The primary color establishes brand identity and draws attention to key actions. DARK THEME: Uses the same filled/light variant system with adjusted values for dark background contrast. Includes: filled (solid backgrounds), light (subtle backgrounds), contrast (text on primary), and full shade scale (0-9).",
            "filled": {
                "$value": "{colorPalette.blue.filled}",
                "$type": "color",
                "$description": "Primary filled background color (shade 4 in dark theme - lighter than light theme's shade 6). Use for: primary button backgrounds, selected toggles, active tabs, main CTAs. This is the HERO primary color - highest brand visibility. ACCESSIBILITY: Use with primary.contrast text for proper contrast. Common in: Button (primary), active Tab, selected Checkbox/Radio, primary Badge."
            },
            "filled-hover": {
                "$value": "{colorPalette.blue.filled-hover}",
                "$type": "color",
                "$description": "Primary filled hover state background (shade 5 in dark theme). Use for: primary button hover, active element hover feedback. In dark theme, filled hover gets LIGHTER (toward white). Common in: Button (primary):hover, active Tab:hover, primary action hover states."
            },
            "light": {
                "$value": "{colorPalette.blue.light}",
                "$type": "color",
                "$description": "Primary light/subtle background color (shade 8 in dark theme - darkened blue). Use for: subtle primary emphasis, light variant buttons, selected row backgrounds, info alerts. On dark backgrounds, 'light' variant uses darker shades. Common in: Button (primary light variant), selected Table row, Alert (info), Tag/Chip (primary)."
            },
            "light-hover": {
                "$value": "{colorPalette.blue.light-hover}",
                "$type": "color",
                "$description": "Primary light hover state background (shade 7 in dark theme). Use for: light primary button hover, selected row hover. In dark theme, light variant hovers get LIGHTER. Common in: Button (primary light):hover, selected row:hover."
            },
            "light-color": {
                "$value": "{colorPalette.blue.light-color}",
                "$type": "color",
                "$description": "Text color for use ON primary.light backgrounds (shade 4 in dark theme). Use for: text in light primary buttons, labels in info alerts, icons on light primary surfaces. Ensures readable contrast on subtle primary backgrounds. Common in: Button (primary light) text, Alert (info) text, light primary Badge text."
            },
            "contrast": {
                "$value": "{color.white}",
                "$type": "color",
                "$description": "Contrast text color for use ON primary.filled backgrounds. White in both themes. Use for: primary button text, icons on primary backgrounds, text overlaid on brand colors. CRITICAL for accessibility - ensures readable text on primary surfaces. Common in: Button (primary) text/icon, primary Badge text, primary Chip text."
            },
            "0": {
                "$value": "{color.blue.0}",
                "$type": "color",
                "$description": "Primary shade 0 - lightest. In dark theme, rarely used as background (too light). May be used for: light text accents, decorative elements, inverted contexts. Common in: Light accents on dark, decorative elements."
            },
            "1": {
                "$value": "{color.blue.1}",
                "$type": "color",
                "$description": "Primary shade 1. In dark theme, may appear as very light accent. Use for: subtle light accents, high-contrast elements against dark backgrounds. Common in: Decorative light accents."
            },
            "2": {
                "$value": "{color.blue.2}",
                "$type": "color",
                "$description": "Primary shade 2. Use for: lighter accents, progress bar fills on dark backgrounds, light indicators. Common in: Progress indicators, decorative elements."
            },
            "3": {
                "$value": "{color.blue.3}",
                "$type": "color",
                "$description": "Primary shade 3. Use for: medium-light accents, badges, icons that need to stand out on dark backgrounds. Common in: Badge backgrounds, icon fills."
            },
            "4": {
                "$value": "{color.blue.4}",
                "$type": "color",
                "$description": "Primary shade 4 - PRIMARY INTERACTIVE FOR DARK THEME. Main shade for buttons and interactive elements in dark theme. Use for: primary buttons, links, active states. Lighter than light theme's shade 6 for proper contrast on dark backgrounds. Common in: Button (primary), Anchor, Checkbox:checked, Radio:selected."
            },
            "5": {
                "$value": "{color.blue.5}",
                "$type": "color",
                "$description": "Primary shade 5. Use for: primary button hover in dark theme, focus rings, medium emphasis accents. Common in: Button (primary):hover, Focus ring color, interactive element outlines."
            },
            "6": {
                "$value": "{color.blue.6}",
                "$type": "color",
                "$description": "Primary shade 6. In dark theme, used for: hover states, active indicators, medium-dark accents. Still visible but darker than the interactive shade. Common in: Active states, hover feedback on lighter elements."
            },
            "7": {
                "$value": "{color.blue.7}",
                "$type": "color",
                "$description": "Primary shade 7. Use for: subtle backgrounds on dark surfaces, 'light' variant hover in dark theme, dark accents. Common in: Subtle primary backgrounds, light variant hover states."
            },
            "8": {
                "$value": "{color.blue.8}",
                "$type": "color",
                "$description": "Primary shade 8. Use for: 'light' variant backgrounds in dark theme (primary.light), very subtle primary tinting on dark surfaces. Near-black with primary tint. Common in: Primary light background, subtle surface tinting."
            },
            "9": {
                "$value": "{color.blue.9}",
                "$type": "color",
                "$description": "Primary shade 9 - darkest primary. In dark theme, nearly black. Use for: extremely subtle backgrounds, near-invisible primary tints, deep surface colors. Common in: Very subtle surface variations."
            }
        }
    }
}
