{
  "borderStyle": {
    "dashed": {
      "$description": "borderStyle.dashed — Dashed border style. Use for: drop zones, placeholder elements, 'add new' areas, temporary states, grouping without containment. Suggests incompleteness or potential. Common in: drag-and-drop zones, placeholder cards, dashed separators.",
      "$type": "strokeStyle",
      "$value": "dashed"
    },
    "dotted": {
      "$description": "borderStyle.dotted — Dotted border style. Use for: decorative elements, subtle separators, accessibility focus alternatives, lightweight boundaries. Softer than dashed. Common in: decorative dividers, coupon borders, alternative focus styles.",
      "$type": "strokeStyle",
      "$value": "dotted"
    },
    "none": {
      "$description": "borderStyle.none — No border style. Use for: removing inherited borders, clean/minimal designs, when using other separation methods. CSS keyword. Equivalent to border-style: none;.",
      "$type": "strokeStyle",
      "$value": "none"
    },
    "solid": {
      "$description": "borderStyle.solid — Solid border style. DEFAULT for all standard borders. Use for: inputs, cards, buttons, tables, containers. Continuous line - clean and professional. CSS keyword.",
      "$type": "strokeStyle",
      "$value": "solid"
    }
  },
  "borderWidth": {
    "medium": {
      "$description": "borderWidth.medium — Medium border (2px). Use for: emphasis, active/selected states, focus indicators, section dividers. More prominent than thin - draws attention. Common in: active tab indicators, selected items, heavy dividers, emphasized cards.",
      "$type": "borderWidth",
      "$value": "2px"
    },
    "none": {
      "$description": "borderWidth.none — No border (0px). Use for: removing inherited borders, borderless variants, flat designs. CSS: border-width: 0; Common in: ghost buttons, flat cards, seamless containers.",
      "$type": "borderWidth",
      "$value": "0"
    },
    "thick": {
      "$description": "borderWidth.thick — Thick border (4px). Use for: strong emphasis, decorative elements, major section dividers, brand accents. Very prominent - use sparingly. Common in: hero sections, brand elements, major visual accents, side indicators.",
      "$type": "borderWidth",
      "$value": "4px"
    },
    "thin": {
      "$description": "borderWidth.thin — Thin border (1px). DEFAULT for most UI borders. Use for: input fields, cards, tables, subtle containment, dividers. Provides structure without visual weight. Common in: Input, Select, Card, Table, dividers, most bordered elements.",
      "$type": "borderWidth",
      "$value": "1px"
    }
  }
}