{
  "motion": {
    "duration": {
      "fast": {
        "$description": "motion.duration.fast — Fast transitions (100ms). Use for: micro-interactions, hover states, button presses, checkbox toggles, small element transitions, focus rings. Feels instantaneous but smooth. Anything faster is imperceptible. Common in: hover color changes, button active states, toggle switches, icon transitions.",
        "$type": "duration",
        "$value": "100ms"
      },
      "instant": {
        "$description": "motion.duration.instant — Instant/no duration (0ms). Use for: prefers-reduced-motion fallback, immediate state changes, disabled animations, no-transition scenarios. CSS: transition-duration: 0ms; effectively disables transitions. ACCESSIBILITY: Use this as fallback for users who prefer reduced motion.",
        "$type": "duration",
        "$value": "0ms"
      },
      "normal": {
        "$description": "motion.duration.normal — Normal transitions (200ms). DEFAULT duration for most UI transitions. Use for: dropdown menus, tooltips, tab switches, sidebar toggles, modal fade-ins, standard UI feedback. Balanced: noticeable but not slow. Common in: Dropdown, Tooltip, Tab panels, collapsible sections.",
        "$type": "duration",
        "$value": "200ms"
      },
      "slow": {
        "$description": "motion.duration.slow — Slow transitions (300ms). Use for: larger element transitions, slide-in panels, accordion expansions, page section reveals, image transitions. Gives eye time to track larger movements. Common in: sidebar slide, accordion panels, card reveals, hero image transitions.",
        "$type": "duration",
        "$value": "300ms"
      },
      "slower": {
        "$description": "motion.duration.slower — Slower transitions (500ms). MAXIMUM recommended duration. Use for: full-page transitions, dramatic reveals, onboarding animations, marketing flourishes. Any longer feels unresponsive. Use sparingly - only for intentional dramatic effect. Common in: page transitions, hero animations, loading sequences.",
        "$type": "duration",
        "$value": "500ms"
      }
    },
    "easing": {
      "ease": {
        "$description": "motion.easing.ease — Standard ease curve - CSS default. Quick start, gradual slow-down. Use for: general-purpose transitions when specific easing isn't needed. Good default but 'easeOut' often feels better for UI. CSS: ease. Common in: fallback transitions, simple state changes.",
        "$type": "cubicBezier",
        "$value": [
          0.25,
          0.1,
          0.25,
          1
        ]
      },
      "easeIn": {
        "$description": "motion.easing.easeIn — Ease in - starts slow, accelerates. CSS: ease-in. Use for: elements LEAVING the screen, dismissals, fade-outs, exits. Creates sense of departure/acceleration away. AVOID for entrances - feels sluggish. Common in: modal dismiss, toast exit, dropdown close, element removal animations.",
        "$type": "cubicBezier",
        "$value": [
          0.42,
          0,
          1,
          1
        ]
      },
      "easeInOut": {
        "$description": "motion.easing.easeInOut — Ease in and out - slow start, fast middle, slow end. CSS: ease-in-out. Use for: elements transforming in place, position changes, size changes, bidirectional animations. Natural for movements that start and end at rest. Common in: tab transitions, carousel slides, position animations, transform effects.",
        "$type": "cubicBezier",
        "$value": [
          0.42,
          0,
          0.58,
          1
        ]
      },
      "easeOut": {
        "$description": "motion.easing.easeOut — Ease out - starts fast, decelerates. CSS: ease-out. RECOMMENDED for most UI transitions. Use for: elements ENTERING the screen, reveals, expansions, focus states. Creates sense of arrival/settling into place. Feels responsive and natural. Common in: modal open, tooltip appear, dropdown open, hover effects.",
        "$type": "cubicBezier",
        "$value": [
          0,
          0,
          0.58,
          1
        ]
      },
      "emphasized": {
        "$description": "motion.easing.emphasized — Emphasized deceleration - quick start, strong deceleration. Custom Material-inspired curve. Use for: attention-grabbing entrances, important notifications, emphasized reveals, dramatic effect. More pronounced than standard easeOut. Use sparingly for emphasis. Common in: snackbar/toast entrance, important alerts, feature reveals, celebration animations.",
        "$type": "cubicBezier",
        "$value": [
          0.2,
          0,
          0,
          1
        ]
      },
      "linear": {
        "$description": "motion.easing.linear — Linear easing - constant speed, no acceleration. CSS: linear. Use for: progress bars, looping animations, continuous scrolling, mechanical movements. Feels robotic/artificial - avoid for UI interactions. Only use when constant speed is intentionally desired. Common in: progress indicators, loading spinners, continuous carousels.",
        "$type": "cubicBezier",
        "$value": [
          0,
          0,
          1,
          1
        ]
      }
    }
  }
}