{
  "radius": {
    "xs": {
      "$value": "0.125rem",
      "$type": "borderRadius",
      "$description": "radius.xs — Extra small radius (2px). Use for: small badges, tags, inline code blocks, tiny indicators, nested elements inside sm-radius containers. Barely perceptible rounding - softens without calling attention. Common in: chip components, status dots, code snippets."
    },
    "sm": {
      "$value": "0.25rem",
      "$type": "borderRadius",
      "$description": "radius.sm — Small radius (4px). DEFAULT for small components. Use for: buttons, inputs, dropdowns, tooltips, small cards, table cells. The workhorse radius - professional and subtle. Most form elements use this. Common in: Button, Input, Select, Badge, Alert."
    },
    "md": {
      "$value": "0.5rem",
      "$type": "borderRadius",
      "$description": "radius.md — Medium radius (8px). Use for: cards, modals, dialogs, larger containers, image thumbnails, panels. Creates friendly, approachable feel without being playful. Common in: Card, Modal, Popover, larger interactive surfaces."
    },
    "lg": {
      "$value": "1rem",
      "$type": "borderRadius",
      "$description": "radius.lg — Large radius (16px). Use for: hero cards, featured content, marketing components, prominent UI elements. Noticeably rounded - use intentionally for emphasis or friendly tone. Common in: feature cards, promotional banners, onboarding modals."
    },
    "xl": {
      "$value": "2rem",
      "$type": "borderRadius",
      "$description": "radius.xl — Extra large radius (32px). Use for: hero sections, large promotional elements, artistic layouts, very large cards. Significantly rounded - creates soft, approachable aesthetic. Use sparingly - can feel too casual for business applications."
    },
    "full": {
      "$value": "9999px",
      "$type": "borderRadius",
      "$description": "radius.full — Full/pill radius (circular). Use for: avatar circles, round buttons, pill-shaped tags, circular indicators, FABs. Creates perfect circles on square elements or pill shapes on rectangles. Common in: Avatar, round IconButton, pill Badge, circular progress."
    },
    "default": {
      "$value": "{radius.sm}",
      "$type": "borderRadius",
      "$description": "radius.default — Default border radius when no size is specified. References radius.sm (4px) as a safe default for most components. Use this when a component needs rounded corners but no specific size is mandated."
    }
  }
}