{
    "$description": "Core font size primitives using rem units for accessibility. Rem-based sizes respect user browser font size preferences (important for low-vision users). Base: 1rem = 16px at default browser settings. Scale follows a modular ratio for harmonious size relationships.",
    "fontSizes": {
        "$description": "Type scale from small helper text to large display headings. Use semantic names (xs, sm, md) rather than pixel values. Pair font sizes with appropriate line heights for optimal readability. ACCESSIBILITY: Never set font-size below xs (12px) for any readable content.",
        "$type": "fontSizes",
        "2xl": {
            "$description": "2x large font size (22px). Use for: medium headings (h3), component titles, feature headings. Clearly heading-sized but not dominant. Common in: h3 headings, sidebar section titles, panel headers.",
            "$value": "1.375rem"
        },
        "3xl": {
            "$description": "3x large font size (26px). Use for: prominent headings (h3), page section titles. Commands attention without overwhelming. Common in: h3 headings, dashboard section titles, feature section headers.",
            "$value": "1.625rem"
        },
        "4xl": {
            "$description": "4x large font size (34px). Use for: major headings (h1-h2), page titles, hero text. Primary visual hierarchy anchor. Common in: page titles, h1/h2 headings, hero headlines. Pair with lineHeight.xs or lineHeight.sm for tighter leading.",
            "$value": "2.125rem"
        },
        "lg": {
            "$description": "Large font size (18px). Use for: lead paragraphs, emphasized body text, large UI elements, h4 headings. Bridges body and heading sizes. Common in: intro paragraphs, feature descriptions, prominent labels, h4, large button text.",
            "$value": "1.125rem"
        },
        "md": {
            "$description": "Medium font size (16px). DEFAULT body text size. Use for: primary body text, paragraphs, form inputs, buttons, main content, h5 headings. Browser default - optimal for extended reading. WCAG baseline assumption for contrast calculations. Common in: body text, input values, primary UI text, h5.",
            "$value": "1rem"
        },
        "sm": {
            "$description": "Small font size (14px). Use for: secondary text, table content, form labels, captions, sidebar content, h6 headings. Comfortable for extended reading in UI contexts. Common in: data tables, form labels, navigation items, secondary buttons, h6. Good balance of density and readability.",
            "$value": "0.875rem"
        },
        "xl": {
            "$description": "Extra large font size (20px). Use for: subtitle text, section labels, prominent UI elements, blockquotes. Between body and heading scale. Common in: modal titles, section headers within content, blockquotes.",
            "$value": "1.25rem"
        },
        "xs": {
            "$description": "Extra small font size (12px). MINIMUM readable size. Use for: helper text, timestamps, metadata, legal text, footnotes, badge content. Requires high contrast - use with strong foreground colors. Not recommended for primary content. Common in: timestamps, version numbers, copyright notices.",
            "$value": "0.75rem"
        }
    }
}
