{
    "$description": "Core line height primitives as percentage values. Percentage values scale proportionally with font size (150% = 1.5x font-size). ACCESSIBILITY: WCAG 1.4.12 requires line-height of at least 150% for body text. Tighter values (xs, sm) only for headings and single-line elements.",
    "lineHeights": {
        "$description": "Line height scale from tight (display) to loose (prose). Match line height to content type: tighter for headings, looser for body text. RULE: Longer line lengths need more line height. Use xs-sm only for headings/buttons, md-xl for readable content.",
        "$type": "lineHeights",
        "2xs": {
            "$description": "Extra tight line height (130%). Use for: large headings (h1) where text needs slightly more breathing room than xs but remains compact. Matches Mantine v8 h1 lineHeight (1.3). Common in: h1 page titles, primary headings.",
            "$value": "130%"
        },
        "lg": {
            "$description": "Relaxed line height (165%). Use for: longer paragraphs, improved readability, wide content areas, users who need more visual separation. Better for sustained reading. Common in: article content, documentation, expanded descriptions, accessibility-focused interfaces.",
            "$value": "165%"
        },
        "md": {
            "$description": "Normal line height (150%). WCAG MINIMUM for body text. Use for: standard body text, paragraphs, UI descriptions, form inputs, most readable content. Baseline for accessibility compliance. Common in: body paragraphs, descriptions, form values, help text, table cells.",
            "$value": "150%"
        },
        "sm": {
            "$description": "Snug line height (135%). Use for: smaller headings (h3-h6), subheadings, short multi-line text, compact interfaces. Tighter than body but readable for short passages. Common in: h3-h6 headings, card titles, navigation items, form labels, compact UI text.",
            "$value": "135%"
        },
        "xl": {
            "$description": "Loose line height (180%). Use for: long-form prose, documentation, maximum readability, accessibility accommodations. Very generous spacing between lines. Common in: blog posts, help documentation, legal text, content prioritizing readability over density.",
            "$value": "180%"
        },
        "xs": {
            "$description": "Tightest line height (120%). Use for: large display headings, hero text, single-line elements, buttons, badges. Text appears compact and impactful. CAUTION: Not accessible for multi-line body text. Only use for display text 24px+ or single-line UI elements. Common in: display headlines, hero text, button text, badge labels.",
            "$value": "120%"
        }
    }
}
